{
	"chapters": 
	{
		"3":
		[
			{
				"id": "mike",
				"table": {
					"name": [
						"M.I.K.E.",
						"M.I.K.E.",
						"Monitor. Influence. Know. Exploit."
					],
					"pronouns": "He/him",
					"role": "Main Antagonist",
					"object": "Toriel's TV"
				},
				"description": "The big boss of Rook Technologies (and all of Telehaven), M.I.K.E. never fails to bring your favorite gameshows to life! With his endless charisma, he can turn any situation thrown at him into an spectacle, while overworked employees suffer behind the scenes.\n\nOnce Kris opened the fountain, M.I.K.E. knew it was time to make them wish they would've carried out their little plan earlier. Maybe they can learn a thing or two about what it's like to fulfill someone else's legacy...",
				"trivia": [
					"M.I.K.E. values family the same way he values money.",
					"He likes building dioramas and very tiny things. No one is supposed to know.",
					"Still thinks about Tenna sometimes, and hates that."
				],
				"image": {
					"default": "../assets/img/disc/ch3/mike.png",
					"hover": "../assets/img/disc/ch3/mike_2.png"
				}
			},
			{
				"id": "nick",
				"table": {
					"name": [
						"Nick L. Odeion",
						"Nick \"Lumière\" Odeion"
					],
					"pronouns": "He/him",
					"role": "Secondary Antagonist...?",
					"object": "Dreemurr Vintage Camera"
				},
				"description": "Nick L. Odeion knows everything there is to old-fashioned cinema and theater, and has an unique gift of displaying and controlling memories.\n\nHis objective is to make sure Kris and their friends traverse safely through the Metropolis, while avoiding trouble with M.I.K.E. There is, however, a lingering sadness that radiates through him, but it seems he will never tell you about any of that.",
				"trivia": [
					"Nick's blood has high levels of nitrate which results in him easily getting drunk on vinegar.\nLet's just hope the guy isn't flammable...",
					"Nick is unable to see any colour, viewing the world through a sepia lens.",
					"Nick is what you would call a \"memory vampire\", feeding on positive memories."
				],
				"image": {
					"default": "../assets/img/disc/ch3/nick.png",
					"hover": "../assets/img/disc/ch3/nick_2.png"
				}
			},
			{
				"id": "halojack",
				"table": {
					"name": [
						"Halojack", 
						"Halojack"
					],
					"pronouns": "She/her",
					"role": "Secret Boss",
					"object": "Signal Amplifier",
					"soulMode": "../assets/img/cursor/heart_cyan.png",
					"items": [
						{
							"name": "Gloryslicer",
							"icon": "../assets/img/disc/equip_sword.png"
						},
						{
							"name": "IdConcealer",
							"icon": "../assets/img/disc/equip_armor.png"
						}
					]
				},
				"description": "Those who knew Halojack recall that she used to be a mere journalist in News Valley. One day, she left the monotony of her job to try her luck in Rook Technologies as an intern.\n\nAs things went wrong, and with a <a href=\"/ch3/rapture\">strange force</a> seemingly guiding her, Halojack had turned to broadcast hijacking as a way to spread deranged messages across Telehaven.\n\nAfter being fired and pursued, her reign of terror had finally faded into obscurity, even though some swear they can catch strange signal intrusions from the corner of their eyes.",
				"trivia": [
					"Halojack is an avid people watcher. She enjoys observing others and keeping herself updated on their lives... even if they never notice.",
					"She has taken knitting as a hobby to avoid stress. All of her socks are handmade.",
					"She needs eyedrops regularly. Her vision is strained.",
					"Ironically, Halojack is very impatient."
				],
				"image": {
					"default": "../assets/img/disc/ch3/halojack.png",
					"hover": "../assets/img/disc/ch3/halojack_2.gif"
				}
			}
		],
		"4": 
		[
			{
				"id": "gospiel",
				"table": {
					"name": [
						"Gospiel", 
						"Gospiel"
					],
					"pronouns": "She/her",
					"role": "Main Antagonist",
					"object": "Angel Doll"
				},
				"description": "Gospiel is a frantic nun who appeared one day by the Great Pillars and swayed the locals with her unusual, powerful presence.\n\nThis ended up with the Bishop being cast aside, and Gospiel taking his manor and prestigious title to herself. Her sacred power comes from a strong prayer to a loved one's safety, and once she sees Noelle, the pieces start to fit together.",
				"trivia": [
					"Given her origins, Gospiel has a natural talent for painting and most of her powers are linked to art. She has turned the manor into her own gallery. Some say her paintings look almost TOO real...",
					"Her favorite subject to paint is The Acolyte. They are very close.",
					"Don't be fooled by her caring and kind demeanor. She has favorites.",
					"Loves wine, but you will never see her drunk in public."
				],
				"image": {
					"default": "../assets/img/disc/ch4/gospiel.png",
					"hover": "../assets/img/disc/ch4/gospiel_2.png"
				}
			},
			{
				"id": "acolyte",
				"table": {
					"name": [
						"The Acolyte",
						"The Acolyte",
						"Mesmer"
					],
					"pronouns": "She/her",
					"role": "Secondary Antagonist",
					"object": "Church Organ"
				},
				"description": "A mysterious Acolyte that can often be found close to Gospiel. After the Bishop's removal from power, she made it her purpose to protect the nun from potential danger and give her a second opinion where needed.\n\nWhile harsh, she does it all with a reason and might actually be quite sweet once you peel back the layers.",
				"trivia": [
					"Always seen wearing an odd eyemask. What is she hiding?",
					"Has an old fashioned way of speaking, giving Rouxls Kaard a run for his money.",
					"While half of her face is covered, nothing seems to escape her cold gaze."
				],
				"image": {
					"default": "../assets/img/disc/ch4/acolyte.png",
					"hover": "../assets/img/disc/ch4/acolyte_2.png"
				}
			},
			{
				"id": "beltrowel",
				"table": {
					"name": [
						"Beltrowel",
						"Beltrowel"
					],
					"pronouns": "He/him",
					"role": "Secret Boss",
					"object": "Church Bell",
					"soulMode": "../assets/img/cursor/heart_green.png",
					"items": [
						{
							"name": "VesperRing",
							"icon": "../assets/img/disc/equip_ring.png"
						},
						{
							"name": "CorruptStole",
							"icon": "../assets/img/disc/equip_armor.png"
						}
					]
				},
				"description": "Beltrowel used to be a priest in Divine Manor. While being known as a holy man, his selfishness did not go unnoticed by a <a href=\"/ch4/wisdom\">strange visitor</a> who one day stepped foot into his confession booth.\n\nAfter that encounter, Beltrowel began to refuse his role to assist Lightners, preaching about a terrible calamity soon to come. Once word got out to the Bishop of a lunatic trying to offer \"salvation\", Beltrowel was swiftly decommissioned and trapped inside a well with a powerful incantation...",
				"trivia": [
					"Beltrowel has a great singing voice. In fact, he speaks very sing-songy.",
					"He finds flower baths to be relaxing. He usually picks red roses, his favorite flower — his bathtub often stained with red.",
					"Why serve Lightners when they care so little about you...? That's what he thinks.",
					"Beltrowel excels at manipulation to get what he wants. Maybe one day, a fellow Darkner will agree to his plan..."
				],
				"image": {
					"default": "../assets/img/disc/ch4/beltrowel.png",
					"hover": "../assets/img/disc/ch4/beltrowel_2.gif"
				}
			}
		],
		"5": 
		[
			{
				"id": "firefly",
				"table": {
					"name": [
						"Firefly",
						"Firefly"
					],
					"pronouns": "She/they",
					"role": "Main Antagonist",
					"object": "Flying Coaster"
				},
				"description": "An adventurous and eccentric lady, Firefly cares deeply about keeping Dreamland running. She's absolutely determined to bring a smile to everyone's faces, even if it means a little danger is put into mix.\n\nTo Firefly, you can't truly have fun witout a spike of adrenaline... and that's why she always cooks up extravagant inventions to blow the Lightner visitors away!",
				"trivia": [
					"Was once part of a dueling coaster with her brother. After the incident, her ride was repurposed entirely and turned into the park's crown jewel.",
					"She loves the hell out of heights."
				],
				"image": {
					"default": "../assets/img/disc/ch5/firefly.png",
					"hover": "../assets/img/disc/ch5/firefly_2.png"
				}
			},
			{
				"id": "spreeblitz",
				"table": {
					"name": [
						"Spree Blitz",
						"Spree Blitz"
					],
					"pronouns": "He/they/it",
					"role": "Secret Boss",
					"object": "Suspended Looping Coaster",
					"soulMode": "../assets/img/cursor/heart_orange.png",
					"items": [
						{
							"name": "BrokenTracks",
							"icon": "../assets/img/disc/equip_sword.png"
						},
						{
							"name": "Safety Belt",
							"icon": "../assets/img/disc/equip_armor.png"
						}
					]
				},
				"description": "Spree Blitz, along with his sister Firefly, was part of an inseparable duo who helped manage Dreamland. One day, his ride got decommissioned after a malfunction had caused the death of <a href=\"/ch5/ebott\">two Lightners</a>.\n\nThey were never the same after the accident, his behavior erratic and bringing danger to those around him. With no other choice, Firefly was forced to leave them behind in an abandoned section of the park.\n\nSpree Blitz, embittered, and wishing to return to his days of glory, was then offered aid by a <a href=\"/ch5/beast\">strange man</a>. He gave it a peculiar crystal, and Spree Blitz, faced with the knowledge of the impossible, short-circuited and entered a comatose state. There it'd stay, forgotten by the world, awaiting the day Lightners would pass by and reactivate him.",
				"trivia": [
					"Gravi, the shopkeeper, helps keep an eye on him as Spree Blitz has proven to be extremely dangerous.",
					"Firefly comes by to visit its mechanical tomb whenever guilt decides to consume her.",
					"They once met a strange priest and grew close to him. Little did they know that later on the priest would steal his eyes as a morbid memento. ...Maybe that's fine by him."
				],
				"image": {
					"default": "../assets/img/disc/ch5/spreeblitz.png",
					"hover": "../assets/img/disc/ch5/spreeblitz_2.gif"
				}
			},
			{
				"id": "comet",
				"table": {
					"name": [
						"Comet Holiday",
						"Comet Holiday", 
						"Comet Leonard (Maiden Name)"
					],
					"pronouns": "She/her",
					"role": "Side Character",
					"object": ""
				},
				"description": "As mayor, Comet seems to always be focused on her job, leaning towards being a workaholic. This leaves her with no time to be present for her family, and more often than not, she is severely stressed out.\n\nShe takes her job very seriously and always does what she thinks is best for the town. Dess' disappearance and Rudy's hospitalization shook her greatly, however, which only made her become even more strict with Noelle and closed off emotionally.",
				"trivia": [
					"A true coffee addict. It helps her function.",
					"Not only her relationship with Noelle is shaken, but her marriage as well.",
					"Always busy. Always.",
					"She loves her family so much it hurts."
				],
				"image": {
					"default": "../assets/img/disc/ch5/comet.png",
					"hover": "../assets/img/disc/ch5/comet_2.png"
				}
			},
			{
				"id": "pollyanna",
				"table": {
					"name": [
						"Pollyanna", 
						"Pollyanna Dew", 
						"\"Polly\""
					],
					"pronouns": "She/her",
					"role": "Side Character",
					"object": ""
				},
				"description": "As a resident of Hometown during her teenage years, Pollyanna wishes she could go back to the simpler days where all she did was play baseball and throw paper planes at Gerson. After the disaster that was college in Ebott City, she dropped out and started working at the local theme park to get by.\n\nSadly for her, she hates kids... But getting to see a few people who were once part of her past isn't so bad.",
				"trivia": [
					"Knows Susie. They get along well.",
					"Asriel did not tell her the truth. She thinks Dess has ghosted her online.",
					"Despite everything, Pollyanna still believes in better days."
				],
				"image": {
					"default": "../assets/img/disc/ch5/pollyanna.png",
					"hover": "../assets/img/disc/ch5/pollyanna_2.png"
				}
			}
		],
		"6": 
		[
			{
				"id": "beholder",
				"table": {
					"name": [
						"The Beholder",
						"The Beholder"
				],
					"pronouns": "He/they",
					"role": "Main Antagonist",
					"object": ""
				},
				"description": "The Beholder is someone... peculiar. He says he's a lab assistant to... someone, but he doesn't seem very enthusiastic about it.\n\nHe appears to be currently stranded in The Depths, and is antsy to get out once he finishes his \"main objective\" there.",
				"trivia": [
					"They rhyme. Like, a lot.",
					"Has a tendency to stare (like cats do) and make unnecessary or blunt observations.",
					"His main function is to observe experiments from up close and write reports with his notes."
				],
				"image": {
					"default": "../assets/img/disc/ch6/beholder.png",
					"hover": "../assets/img/disc/ch6/beholder_2.png"
				}
			},
			{
				"id": "friend",
				"table": {
					"name": [
						"FRIEND",
						"FRIEND", 
						"DEVICE_FRIEND"
					],
					"pronouns": "It/they",
					"role": "Secondary Antagonist",
					"object": ""
				},
				"description": "Intrinsically connected to the DEVICE, no one knows where exactly this creature came from. Its glitchy body can disperse itself into arachnids that form webs wherever they see fit, and all that is left is a FACE... staring back at you.\n\nA trickster at heart, this FRIEND will be yours for all ETERNITY.",
				"trivia": [
					"Those who go glitch hunting get to see them first.",
					"Not a cat! A raccoon that hangs around trash.",
					"An all powerful entity...? Maybe not. Just a friend you wouldn't want to mess with.",
					"Makes a room for itself everywhere they go."
				],
				"image": {
					"default": "../assets/img/disc/ch6/friend.gif",
					"hover": "../assets/img/disc/ch6/friend_2.gif"
				}
			},
			{
				"id": "gauze",
				"table": {
					"name": [
						"Gauze", 
						"Gauze",
						"The Vessel"
					],
					"pronouns": "They/them",
					"role": "Secret Boss",
					"object": "",
					"soulMode": "../assets/img/cursor/heart_purple.png",
					"items": [
						{
							"name": "GonerLabrys",
							"icon": "../assets/img/disc/equip_axe.png"
						},
						{
							"name": "SoulBandage",
							"icon": "../assets/img/disc/equip_armor.png"
						}
					]
				},
				"description": "Being tossed aside upon their creation, \"Gauze\" has to live with a decaying body, slowly feeling the life being chipped away from them. Clinging to what little identity they have, they persist, even in the face of The Depths' pressure.\n\nBeing cursed with a <a href=\"/ch6/gbody\">mirror</a> directly into Kris's life, envy and anger began to boil inside them. Maybe they have a proposition that can help both of them out.",
				"trivia": [
					"They wear a bandage on their cheek, stained by sickly pink-colored liquid. It has a strange aura.",
					"Can induce VERTIGO status effect.",
					"Despite their best efforts, decay is imminent. They're in denial of that."
				],
				"image": {
					"default": "../assets/img/disc/ch6/gauze.png",
					"hover": "../assets/img/disc/ch6/gauze_2.gif"
				}
			}
		],
		"7": 
		[
			{
				"id": "knight",
				"table": {
					"name": [
						"The Roaring Knight",
						"Comet Holiday"
					],
					"pronouns": "She/her",
					"role": "Main Antagonist",
					"object": ""
				},
				"description": "Opened the Chapter 2, 5 and 7's Dark Fountains.\n\nUnder the title of The Roaring Knight, Comet Holiday has made it her goal to find her missing daughter, make sure her husband lives through his illness and mend her relationship with Noelle.\n\nGuided by the love she has for her family, and taking it to the extreme, she has been opening fountains in order to amass power and bring forth a Titan, who will then aid her endless search through the deepest shadows...\n\nMeanwhile, through her incessant prayers to the Angel and her own WISHPOWER being attended, the ANGEL'S HEAVEN is formed, its gateways leading towards a patch of utopic land made specifically for Noelle and Rudy... that while perfect on the surface, is nothing but an illusionary shelter.",
				"trivia": [
					"She has a bow and arrow as her Dark World weapon, and fires comets from it. Its Light World counterpart are scissors, which she also uses to open fountains.",
					"Her element is pure cosmic power, which shapes most of her attacks."
				],
				"image": {
					"default": "../assets/img/disc/ch7/knight.png",
					"hover": "../assets/img/disc/ch7/knight_2.gif"
				}
			},
			{
				"id": "pionite",
				"table": {
					"name": [
						"Pionite",
						"Pionite"
					],
					"pronouns": "He/they",
					"role": "Secondary Antagonist",
					"object": "Christmas Tree Glass Sculpture"
				},
				"description": "A cold, calculated and sinister ruler, Pionite has been using their crystals and ink to build his empire for centuries.\n\nWhen the Knight came to him with an offer, he was more than willing to listen, strongly believing in her cause. He will do whatever it takes to make sure her plans come to fruition.",
				"trivia": [
					"He has his subjects bring gifts and offerings to him constantly.",
					"Residents of the Hyaloid Fortress must always be present for the Yuletide Feast. Show up late and you will be punished.",
					"Everything is a tradition in their eyes, and must be followed thoroughly."
				],
				"image": {
					"default": "../assets/img/disc/ch7/pionite.png",
					"hover": "../assets/img/disc/ch7/pionite_2.png"
				}
			},
			{
				"id": "minerva",
				"table": {
					"name": [
						"Minerva",
						"Minerva"
					],
					"pronouns": "She/her",
					"role": "Secret Boss",
					"object": "Fountain Pen + Penholder",
					"soulMode": "../assets/img/cursor/heart_blue.png",
					"items": [
						{
							"name": "Fatemantle",
							"icon": "../assets/img/disc/equip_scarf.png"
						},
						{
							"name": "DestinyVeil",
							"icon": "../assets/img/disc/equip_armor.png"
						}
					]
				},
				"description": "Minerva was a prolific scribe who wrote the stories of Lightner's history and laws. One day, The Grand Inkwell in her home ran dry, and with no ink, her stories ceased as her powers dwindled. Feeling hopeless, she kept to herself as the world continued on without her.\n\nOn a rare outing, she encountered a <a href=\"/ch7/everything\">strange man</a>. He placed a shard in her hands, and through the inky darkness she saw light.\n\nNowadays, Minerva wanders the depths of Hyaloid Fortress, forever searching for a way to tell the truth of the stories she's heard from the darkness. She firmly believes in The Knight's schemes, having known Comet's despair, and longs to prove herself useful in order to aid her goals.",
				"trivia": [
					"Prim and proper. She is the embodiment of order, doing everything by the book.",
					"She likes pianos and harps. She hasn't made music in a long time.",
					"Masks the fact that she has little self worth."
				],
				"image": {
					"default": "../assets/img/disc/ch7/minerva.png",
					"hover": "../assets/img/disc/ch7/minerva_2.gif"
				}
			}
		]
	}
}